OnePice-C/INV.5KW/INV.5KW.OG.Design/firmware/exemple/sinv_F28P55x/stringINV.syscfg
adc3.adcBase                     = "ADCC_BASE";
adc3.soc0IndependentNameMode     = true;
adc3.soc0InputCapacitance        = 300;
adc3.soc0InputResistance         = 300;
adc3.soc0UseCalculatedSampleTime = true;
adc3.soc1IndependentNameMode     = true;
adc3.soc1InputCapacitance        = 300;
adc3.soc1InputResistance         = 300;
adc3.soc1UseCalculatedSampleTime = true;
adc3.soc2IndependentNameMode     = true;
adc3.soc2InputCapacitance        = 300;
adc3.soc2InputResistance         = 300;
adc3.soc2UseCalculatedSampleTime = true;
adc3.soc3IndependentNameMode     = true;
adc3.soc3InputCapacitance        = 300;
adc3.soc3InputResistance         = 300;
adc3.soc3UseCalculatedSampleTime = true;
adc3.soc4IndependentNameMode     = true;
adc3.soc4InputResistance         = 10000;
adc3.soc4InputCapacitance        = 100000;
adc3.soc5IndependentNameMode     = true;
adc3.soc5SampleWindow            = 100;
adc3.soc0SampleWindow            = 15;
adc3.soc1SampleWindow            = 15;
adc3.soc2SampleWindow            = 15;
adc3.soc3SampleWindow            = 15;
adc3.soc4Trigger                 = "ADC_TRIGGER_EPWM8_SOCA";
adc3.soc4SampleWindow            = 15;
adc3.soc5Trigger                 = "ADC_TRIGGER_EPWM8_SOCB";
adc3.soc6Name                    = "SOC_TEMP";
adc3.soc6IndependentNameMode     = true;
adc3.soc6Channel                 = "ADC_CH_ADCIN1";
adc3.soc6SampleWindow            = 15;
adc3.soc6Trigger                 = "ADC_TRIGGER_EPWM3_SOCA";
adc3.soc4Channel                 = "ADC_CH_ADCIN11";
adc3.soc5Channel                 = "ADC_CH_ADCIN7";
adc3.soc4Name                    = "SOC_AC_VS";
adc3.soc5Name                    = "SOC_DC_BUS_VS";
adc3.registerInterrupts          = ["1"];
adc3.enabledInts                 = ["ADC_INT_NUMBER1"];
adc3.soc2Name                    = "SOC_VS_Boost1";
adc3.soc2Channel                 = "ADC_CH_ADCIN11";
adc3.soc0Name                    = "SOC_CS_Batt1";
adc3.soc0Trigger                 = "ADC_TRIGGER_EPWM5_SOCA";
adc3.soc1Trigger                 = "ADC_TRIGGER_EPWM5_SOCA";
adc3.soc2Trigger                 = "ADC_TRIGGER_EPWM5_SOCA";
adc3.useInterrupts               = false;
adc3.soc3Name                    = "SOC_VAC";
adc3.soc3Trigger                 = "ADC_TRIGGER_EPWM5_SOCA";
adc3.adcClockPrescaler           = "ADC_CLK_DIV_2_0";
adc3.$name                       = "ADC_C";
adc3.soc3Channel                 = "ADC_CH_ADCIN6";
adc3.soc0Channel                 = "ADC_CH_ADCIN1";
adc3.soc1Name                    = "SOC_VAC";
adc3.enabledSOCs                 = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1"];
adc3.soc1Channel                 = "ADC_CH_ADCIN6";

adc4.soc0IndependentNameMode     = true;
adc4.soc0InputCapacitance        = 300;
adc4.soc0InputResistance         = 300;
adc4.soc0UseCalculatedSampleTime = true;
adc4.soc1IndependentNameMode     = true;
adc4.soc1InputCapacitance        = 300;
adc4.soc1InputResistance         = 300;
adc4.soc1UseCalculatedSampleTime = true;
adc4.soc2IndependentNameMode     = true;
adc4.soc2InputCapacitance        = 300;
adc4.soc2InputResistance         = 300;
adc4.soc2UseCalculatedSampleTime = true;
adc4.soc3IndependentNameMode     = true;
adc4.soc3InputCapacitance        = 300;
adc4.soc3InputResistance         = 300;
adc4.soc3UseCalculatedSampleTime = true;
adc4.soc4IndependentNameMode     = true;
adc4.soc4InputResistance         = 10000;
adc4.soc4InputCapacitance        = 100000;
adc4.soc5IndependentNameMode     = true;
adc4.soc5SampleWindow            = 100;
adc4.soc0SampleWindow            = 15;
adc4.soc1SampleWindow            = 15;
adc4.soc2SampleWindow            = 15;
adc4.soc3SampleWindow            = 15;
adc4.soc4Trigger                 = "ADC_TRIGGER_EPWM8_SOCA";
adc4.soc4SampleWindow            = 15;
adc4.soc5Trigger                 = "ADC_TRIGGER_EPWM8_SOCB";
adc4.soc6Name                    = "SOC_TEMP";
adc4.soc6IndependentNameMode     = true;
adc4.soc6Channel                 = "ADC_CH_ADCIN1";
adc4.soc6SampleWindow            = 15;
adc4.soc6Trigger                 = "ADC_TRIGGER_EPWM3_SOCA";
adc4.soc4Channel                 = "ADC_CH_ADCIN11";
adc4.soc5Channel                 = "ADC_CH_ADCIN7";
adc4.soc4Name                    = "SOC_AC_VS";
adc4.soc5Name                    = "SOC_DC_BUS_VS";
adc4.registerInterrupts          = ["1"];
adc4.enabledInts                 = ["ADC_INT_NUMBER1"];
adc4.soc2Name                    = "SOC_VS_Boost1";
adc4.soc2Channel                 = "ADC_CH_ADCIN11";
adc4.soc1Name                    = "SOC_CS_Boost2";
adc4.soc0Trigger                 = "ADC_TRIGGER_EPWM5_SOCA";
adc4.soc1Trigger                 = "ADC_TRIGGER_EPWM5_SOCA";
adc4.soc2Trigger                 = "ADC_TRIGGER_EPWM5_SOCA";
adc4.useInterrupts               = false;
adc4.soc3Name                    = "SOC_VAC";
adc4.soc3Trigger                 = "ADC_TRIGGER_EPWM5_SOCA";
adc4.adcClockPrescaler           = "ADC_CLK_DIV_2_0";
adc4.soc3Channel                 = "ADC_CH_ADCIN6";
adc4.soc1Channel                 = "ADC_CH_ADCIN11";
adc4.$name                       = "ADC_D";
adc4.adcBase                     = "ADCD_BASE";
adc4.enabledSOCs                 = ["ADC_SOC_NUMBER0"];
adc4.soc0Name                    = "SOC_CS_Boost2";
adc4.soc0Channel                 = "ADC_CH_ADCIN15";

asysctl.enableTemperatureSensor = true;
asysctl.analogReference         = "INTERNAL";
asysctl.analogReferenceVoltage  = "1P65";

cmpss1.enableModule  = true;
cmpss1.lowCompInvert = true;
cmpss1.dacValHigh    = 3370;
cmpss1.dacValLow     = 727;
cmpss1.cmpssBase     = "CMPSS2_BASE";
cmpss1.$name         = "myCMPSS_DCAC";

cmpss2.enableModule        = true;
cmpss2.asysCMPHPMXSELValue = "1";
cmpss2.asysCMPLPMXSELValue = "5";
cmpss2.dacValHigh          = 3900;
cmpss2.dacValLow           = 3900;
cmpss2.$name               = "myCMPSS_Boost";

cmpss3.enableModule        = true;
cmpss3.lowCompInvert       = true;
cmpss3.asysCMPLPMXSELValue = "2";
cmpss3.asysCMPHPMXSELValue = "2";
cmpss3.cmpssBase           = "CMPSS4_BASE";
cmpss3.dacValHigh          = 3956;
cmpss3.dacValLow           = 140;
cmpss3.$name               = "myCMPSS_Bidir1";

cmpss4.enableModule        = true;
cmpss4.lowCompInvert       = true;
cmpss4.cmpssBase           = "CMPSS3_BASE";
cmpss4.asysCMPHPMXSELValue = "5";
cmpss4.asysCMPLPMXSELValue = "5";
cmpss4.dacValHigh          = 3956;
cmpss4.dacValLow           = 140;
cmpss4.$name               = "myCMPSS_Bidir2";

