OnePice-C/INV.5KW/INV.5KW.OG.Design/firmware/exemple/sinv_F28P55x/stringINV.syscfg
epwm4.copyFrom                                                   = "BOOST1";
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_LOW";
epwm4.epwmDeadband_enableRED                                     = true;
epwm4.epwmDeadband_enableFED                                     = true;
epwm4.epwmTimebase_hsClockDiv                                    = "EPWM_HSCLOCK_DIVIDER_1";
epwm4.epwmTimebase_emulationMode                                 = "EPWM_EMULATION_FREE_RUN";
epwm4.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_HIGH";
epwm4.epwmDeadband_polarityFED                                   = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm4.epwmTimebase_syncOutPulseMode                              = ["EPWM_SYNC_OUT_PULSE_ON_CNTR_ZERO"];
epwm4.epwmTimebase_counterModeAfterSync                          = "EPWM_COUNT_MODE_UP_AFTER_SYNC";
epwm4.epwmTimebase_syncInPulseSource                             = "EPWM_SYNC_IN_PULSE_SRC_DISABLE";
epwm4.epwmEventTrigger_EPWM_SOC_A_triggerEnable                  = true;
epwm4.epwmEventTrigger_EPWM_SOC_A_triggerSource                  = "EPWM_SOC_TBCTR_ZERO";
epwm4.epwmEventTrigger_EPWM_SOC_A_triggerEventPrescalar          = "3";
epwm4.epwmDeadband_delayRED                                      = 21;
epwm4.epwmDeadband_delayFED                                      = 21;
epwm4.$name                                                      = "Bidirectional1";
epwm4.epwmTimebase_period                                        = 1120;
epwm4.epwm.$assign                                               = "EPWM5";
epwm4.epwm.epwm_aPin.$assign                                     = "GPIO8";
epwm4.epwm.epwm_bPin.$assign                                     = "GPIO9";

epwm5.copyUse                                                    = true;
epwm5.epwmDeadband_polarityFED                                   = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm5.epwmDeadband_enableRED                                     = true;
epwm5.epwmDeadband_enableFED                                     = true;
epwm5.epwmTimebase_hsClockDiv                                    = "EPWM_HSCLOCK_DIVIDER_1";
epwm5.epwmTimebase_emulationMode                                 = "EPWM_EMULATION_FREE_RUN";
epwm5.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm5.epwmTimebase_phaseEnable                                   = true;
epwm5.epwmTimebase_syncInPulseSource                             = "EPWM_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM5";
epwm5.epwmTimebase_oneShotSyncOutTrigger                         = "EPWM_OSHT_SYNC_OUT_TRIG_RELOAD";
epwm5.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_LOW";
epwm5.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_HIGH";
epwm5.epwmDeadband_delayRED                                      = 21;
epwm5.epwmDeadband_delayFED                                      = 21;
epwm5.$name                                                      = "Bidirectional2";
epwm5.copyFrom                                                   = "Bidirectional1";
epwm5.epwmTimebase_period                                        = 1120;
epwm5.epwmTimebase_phaseShift                                    = 1118;
epwm5.epwm.$assign                                               = "EPWM6";
epwm5.epwm.epwm_aPin.$assign                                     = "GPIO10";
epwm5.epwm.epwm_bPin.$assign                                     = "A24, D0, E0, GPIO11";

epwmxbar1.$name      = "myEPWMXBAR0";
epwmxbar1.tripInput  = "XBAR_TRIP5";
epwmxbar1.mux6Config = "XBAR_EPWM_MUX06_CMPSS4_CTRIPH_OR_L";
epwmxbar1.mux0Config = "XBAR_EPWM_MUX00_CMPSS1_CTRIPH_OR_L";
epwmxbar1.muxesUsed  = ["XBAR_MUX00"];

epwmxbar2.$name      = "myEPWMXBAR1";
epwmxbar2.tripInput  = "XBAR_TRIP10";
epwmxbar2.mux2Config = "XBAR_EPWM_MUX02_CMPSS2_CTRIPH_OR_L";
epwmxbar2.mux4Config = "XBAR_EPWM_MUX04_CMPSS3_CTRIPH_OR_L";
epwmxbar2.mux6Config = "XBAR_EPWM_MUX06_CMPSS4_CTRIPH_OR_L";
epwmxbar2.muxesUsed  = ["XBAR_MUX04","XBAR_MUX06"];

epwmxbar3.$name      = "myEPWMXBAR2";
epwmxbar3.tripInput  = "XBAR_TRIP12";
epwmxbar3.mux0Config = "XBAR_EPWM_MUX00_CMPSS1_CTRIPH_OR_L";
epwmxbar3.muxesUsed  = ["XBAR_MUX02"];
epwmxbar3.mux2Config = "XBAR_EPWM_MUX02_CMPSS2_CTRIPH_OR_L";

gpio1.initialValue    = 1;
gpio1.direction       = "GPIO_DIR_MODE_OUT";
gpio1.$name           = "RY_ACPreCharge";
gpio1.gpioPin.$assign = "GPIO62";

gpio2.$name             = "RY_DCPreCharge";
gpio2.writeInitialValue = true;
gpio2.direction         = "GPIO_DIR_MODE_OUT";
gpio2.gpioPin.$assign   = "GPIO57";

gpio3.$name             = "Enable_Buffer_ACDC";
gpio3.writeInitialValue = true;
gpio3.initialValue      = 1;
gpio3.direction         = "GPIO_DIR_MODE_OUT";
gpio3.gpioPin.$assign   = "GPIO56";

gpio4.$name             = "Enable_Buffer_DCDC";
gpio4.writeInitialValue = true;
gpio4.initialValue      = 1;
gpio4.direction         = "GPIO_DIR_MODE_OUT";
gpio4.gpioPin.$assign   = "GPIO55";

gpio5.$name             = "Enable_CAN";
gpio5.writeInitialValue = true;
gpio5.direction         = "GPIO_DIR_MODE_OUT";
gpio5.gpioPin.$assign   = "GPIO58";

gpio6.$name             = "Enable_RS485";
gpio6.writeInitialValue = true;
gpio6.direction         = "GPIO_DIR_MODE_OUT";
gpio6.gpioPin.$assign   = "GPIO61";

gpio7.$name           = "TEMP_MUX_A";
gpio7.direction       = "GPIO_DIR_MODE_OUT";
gpio7.gpioPin.$assign = "GPIO34";

gpio8.$name           = "TEMP_MUX_B";
gpio8.direction       = "GPIO_DIR_MODE_OUT";
gpio8.gpioPin.$assign = "GPIO40";

gpio9.$name           = "TEMP_MUX_C";
gpio9.direction       = "GPIO_DIR_MODE_OUT";
gpio9.gpioPin.$assign = "GPIO44";

gpio10.$name           = "TPGPIO24";
gpio10.direction       = "GPIO_DIR_MODE_OUT";
gpio10.gpioPin.$assign = "GPIO60";

gpio11.direction       = "GPIO_DIR_MODE_OUT";
gpio11.$name           = "LED_FAULT";
gpio11.gpioPin.$assign = "GPIO52";

