OnePice-C/INV.5KW/INV.5KW.OG.Design/firmware/exemple/sinv_F28P55x/stringINV.syscfg
gpio12.$name             = "LED_HEARTBEAT";
gpio12.direction         = "GPIO_DIR_MODE_OUT";
gpio12.writeInitialValue = true;
gpio12.gpioPin.$assign   = "GPIO53";

inputxbar_input1.$name         = "myINPUTXBARINPUT0";
inputxbar_input1.inputxbarGpio = "GPIO51";

inputxbar_input2.$name          = "myINPUTXBARINPUT1";
inputxbar_input2.inputxbarInput = "XBAR_INPUT2";
inputxbar_input2.inputxbarGpio  = "GPIO58";

inputxbar_input3.$name          = "myINPUTXBARINPUT2";
inputxbar_input3.inputxbarInput = "XBAR_INPUT7";
inputxbar_input3.inputxbarGpio  = "GPIO46";

sync.ADCSOCAOutputSelect = ["SYSCTL_ADCSOC_SRC_PWM1SOCA","SYSCTL_ADCSOC_SRC_PWM2SOCA","SYSCTL_ADCSOC_SRC_PWM3SOCA","SYSCTL_ADCSOC_SRC_PWM4SOCA","SYSCTL_ADCSOC_SRC_PWM8SOCA"];
sync.ADCSOCBOutputSelect = ["SYSCTL_ADCSOC_SRC_PWM1SOCB","SYSCTL_ADCSOC_SRC_PWM2SOCB","SYSCTL_ADCSOC_SRC_PWM3SOCB","SYSCTL_ADCSOC_SRC_PWM4SOCB","SYSCTL_ADCSOC_SRC_PWM8SOCB"];

CMD.activateCMD = true;

CMD1.$name                                      = "CMD0";
CMD1.sectionMemory_stack                        = ["RAMM1"];
CMD1.sectionAlignEnable_ramfunc                 = true;
CMD1.sectionRun_ramfunc                         = ["RAMLS0"];
CMD1.sectionRunFromDifferentAddr_ramfunc        = true;
CMD1.sectionAlignEnable_text                    = true;
CMD1.sectionAlignEnable_cinit                   = true;
CMD1.sectionAlignEnable_switch                  = true;
CMD1.sectionAlignEnable_init_array              = true;
CMD1.sectionAlignEnable_const                   = true;
CMD1.sectionMemory_sysmem                       = ["RAMLS5"];
CMD1.sectionAlignEnable_ovly                    = true;
CMD1.sectionAlignEnable_binit                   = true;
CMD1.sectionMemory_codestart                    = "0x080000";
CMD1.sectionMemory_data                         = ["RAMLS5","RAMLS6","RAMLS7"];
CMD1.sectionMemory_bss                          = ["RAMLS5","RAMLS6"];
CMD1.sectionMemory_switch                       = ["FLASH_BANK0"];
CMD1.sectionMemory_const                        = ["FLASH_BANK0"];
CMD1.sectionMemory_init_array                   = ["FLASH_BANK0"];
CMD1.sectionMemory_cinit                        = ["FLASH_BANK0"];
CMD1.sectionMemory_ovly                         = ["FLASH_BANK0"];
CMD1.sectionMemory_binit                        = ["FLASH_BANK0"];
CMD1.sectionMemory_ramfunc                      = ["FLASH_BANK0"];
CMD1.sectionMemory_text                         = ["FLASH_BANK0"];
CMD1.userSection.create(2);
CMD1.userSection[0].$name                       = "dclfuncs";
CMD1.userSection[0].sectionName                 = "dclfuncs";
CMD1.userSection[0].sectionRunFromDifferentAddr = true;
CMD1.userSection[0].sectionRun                  = ["RAMGS1"];
CMD1.userSection[0].sectionAlignEnable          = true;
CMD1.userSection[0].sectionMemory               = ["FLASH_BANK1"];
CMD1.userSection[1].$name                       = "FPUmathTables";
CMD1.userSection[1].sectionName                 = "FPUmathTables";
CMD1.userSection[1].sectionRunFromDifferentAddr = true;
CMD1.userSection[1].sectionRun                  = ["RAMGS1"];
CMD1.userSection[1].sectionAlignEnable          = true;
CMD1.userSection[1].sectionMemory               = ["FLASH_BANK0"];

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
analog1.analog.$suggestSolution                                     = "ANALOG";
analog1.analog["a3, b3, pga2_inp, c5, gpio242Pin"].$suggestSolution = "A3, B3, PGA2_INP, C5, GPIO242";
analog1.analog["a4, b8, c14Pin"].$suggestSolution                   = "A4, B8, C14";
analog1.analog["a6, d14, e14, gpio228Pin"].$suggestSolution         = "A6, D14, E14, GPIO228";
analog1.analog["a9, gpio227Pin"].$suggestSolution                   = "A9, GPIO227";
analog1.analog["a11, b10, c0, pga2_outPin"].$suggestSolution        = "A11, B10, C0, PGA2_OUT";
analog1.analog["a12, c1, e11, pga3_inpPin"].$suggestSolution        = "A12, C1, E11, PGA3_INP";
analog1.analog["a14, b14, c4, pga1_outPin"].$suggestSolution        = "A14, B14, C4, PGA1_OUT";
analog1.analog["a27, d9, e9, gpio212Pin"].$suggestSolution          = "A27, D9, E9, GPIO212";
analog1.analog["a28, d19, e19, gpio215Pin"].$suggestSolution        = "A28, D19, E19, GPIO215";
analog1.analog["b2, c6, e12, gpio226Pin"].$suggestSolution          = "B2, C6, E12, GPIO226";
analog1.analog["b4, c8, gpio236Pin"].$suggestSolution               = "B4, C8, GPIO236";
analog1.analog["b5, d15, e15, pga3_outPin"].$suggestSolution        = "B5, D15, E15, PGA3_OUT";
analog1.analog["b26, d7, e7Pin"].$suggestSolution                   = "B26, D7, E7";
analog1.analog["b27, d10, e10, gpio213Pin"].$suggestSolution        = "B27, D10, E10, GPIO213";
epwm1.epwm.epwm_bPin.$suggestSolution                               = "GPIO23";
epwm2.epwm.$suggestSolution                                         = "EPWM1";
epwm2.epwm.epwm_bPin.$suggestSolution                               = "GPIO1";
